In [38]:
#Paralel Precision LinkedIn Data Analysis

In [39]:
import pandas as pd

In [40]:
import numpy as np

In [41]:
import seaborn as sns

In [42]:
df = pd.read_csv('dux-soup-visit-data@2021-02-23 10h50.csv')

In [43]:
df.head()

,id,VisitTime,Profile,SalesProfile,Picture,Degree,First Name,Middle Name,Last Name,Connections,...,CompanyWebsite,Email,Phone,IM,Twitter,Location,Industry,My Tags,My Notes,Unnamed: 24
0,id.187999202,2021/01/15 09:41:38,https://www.linkedin.com/in/philippaartus,https://www.linkedin.com/sales/people/ACwAAAs0...,https://media-exp1.licdn.com/dms/image/C5603AQ...,3,Philippa,,Artus,1340,...,https://www.moorwand.com,,,,,"London Area, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN
1,id.28086713,2021/01/15 09:42:50,https://www.linkedin.com/in/jappy-takhar-a754a59,https://www.linkedin.com/sales/people/ACwAAAGs...,https://media-exp1.licdn.com/dms/image/C5603AQ...,3,Jappy,,Takhar,1376,...,http://www.comitfs.com,,,,,"London, England, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN
2,id.1310264,2021/01/15 09:43:39,https://www.linkedin.com/in/anjelikaklamp,https://www.linkedin.com/sales/people/ACwAAAAT...,,3,Anjelika,Klamp,Cfa,1069,...,http://www.igen-capital.com,,,,,"London, England, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN
3,id.137682286,2021/01/15 09:44:55,https://www.linkedin.com/in/henry-arundel-2ba1...,https://www.linkedin.com/sales/people/ACwAAAg0...,https://media-exp1.licdn.com/dms/image/C5603AQ...,3,Henry,,Arundel,623,...,http://www.nobleinsurance.co.uk,,,,,"London, England, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN
4,id.2726244,2021/01/15 09:46:20,https://www.linkedin.com/in/simon-freeman-830ab5,https://www.linkedin.com/sales/people/ACwAAAAp...,https://media-exp1.licdn.com/dms/image/C4D03AQ...,3,Simon,,Freeman,515,...,,,,,snowbirdfinance,"Kingston upon Thames, England, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1332 entries, 0 to 1331
Data columns (total 25 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              1332 non-null   object
 1   VisitTime       1332 non-null   object
 2   Profile         1332 non-null   object
 3   SalesProfile    1332 non-null   object
 4   Picture         1332 non-null   object
 5   Degree          1332 non-null   object
 6   First Name      1332 non-null   object
 7   Middle Name     1332 non-null   object
 8   Last Name       1332 non-null   object
 9   Connections     1332 non-null   int64
 10  Summary         1332 non-null   object
 11  From            1332 non-null   object
 12  Title           1332 non-null   object
 13  Company         1332 non-null   object
 14  CompanyProfile  1332 non-null   object
 15  CompanyWebsite  1332 non-null   object
 16  Email           1332 non-null   object
 17  Phone           1332 non-null   object
 18  IM              1332 non-null   object
 19  Twitter         1332 non-null   object
 20  Location        1332 non-null   object
 21  Industry        1332 non-null   object
 22  My Tags         1303 non-null   object
 23  My Notes        0 non-null      float64
 24  Unnamed: 24     0 non-null      float64
dtypes: float64(2), int64(1), object(22)
memory usage: 260.3+ KB

In [45]:
First=df['Degree']=='1'

In [46]:
df[First].sample(5)

,id,VisitTime,Profile,SalesProfile,Picture,Degree,First Name,Middle Name,Last Name,Connections,...,CompanyWebsite,Email,Phone,IM,Twitter,Location,Industry,My Tags,My Notes,Unnamed: 24
1078,id.292791566,2021/02/18 13:36:44,https://www.linkedin.com/in/rowan-gallagher-69...,https://www.linkedin.com/sales/people/ACwAABFz...,https://media-exp1.licdn.com/dms/image/C4E03AQ...,1,Rowan,,Gallagher,1156,...,http://fundsquire.co.uk,,,,,"London, England, United Kingdom",Financial Services,|🦆-default-invited|sent blog 2,NaN,NaN
1089,id.66143089,2021/02/18 13:54:15,https://www.linkedin.com/in/simone-gallo-3011991a,https://www.linkedin.com/sales/people/ACwAAAPx...,https://media-exp1.licdn.com/dms/image/C5603AQ...,1,Simone,,Gallo,4625,...,http://www.mspartners.org,,,,,"London Area, United Kingdom",Financial Services,|🦆-default-invited|Sent Blog 1|sent blog 2,NaN,NaN
1115,id.448763478,2021/02/18 14:30:04,https://www.linkedin.com/in/ellatennant,https://www.linkedin.com/sales/people/ACwAABq_...,https://media-exp1.licdn.com/dms/image/C4D03AQ...,1,Ella,,Tennant,794,...,http://bonhamandbrook.co.uk,ellatennant97@gmail.com,07821194052,,,"London, England, United Kingdom",Financial Services,|🦆-default-invited|sent blog 2,NaN,NaN
1178,id.61007265,2021/02/18 15:54:31,https://www.linkedin.com/in/charlienicholls1,https://www.linkedin.com/sales/people/ACwAAAOi...,https://media-exp1.licdn.com/dms/image/C4D03AQ...,1,Charlie,,Nicholls,737,...,http://www.cpnim.com,charlie@cpnim.co.uk,01243 819101,charlieontoast,Moneyontoast,"London, England, United Kingdom",Financial Services,|🦆-default-invited|sent blog 2,NaN,NaN
1143,id.230107729,2021/02/18 15:10:34,https://www.linkedin.com/in/vincentcarratala,https://www.linkedin.com/sales/people/ACwAAA23...,https://media-exp1.licdn.com/dms/image/C4D03AQ...,1,Vincent,,Carratala,11241,...,https://blockex.com/,vincent@vcis.group,,,,"London Area, United Kingdom",Financial Services,|🦆-default-invited|sent blog 2,NaN,NaN

In [47]:
first=df[First]

In [48]:
first.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 157 entries, 209 to 1213
Data columns (total 25 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              157 non-null    object
 1   VisitTime       157 non-null    object
 2   Profile         157 non-null    object
 3   SalesProfile    157 non-null    object
 4   Picture         157 non-null    object
 5   Degree          157 non-null    object
 6   First Name      157 non-null    object
 7   Middle Name     157 non-null    object
 8   Last Name       157 non-null    object
 9   Connections     157 non-null    int64
 10  Summary         157 non-null    object
 11  From            157 non-null    object
 12  Title           157 non-null    object
 13  Company         157 non-null    object
 14  CompanyProfile  157 non-null    object
 15  CompanyWebsite  157 non-null    object
 16  Email           157 non-null    object
 17  Phone           157 non-null    object
 18  IM              157 non-null    object
 19  Twitter         157 non-null    object
 20  Location        157 non-null    object
 21  Industry        157 non-null    object
 22  My Tags         157 non-null    object
 23  My Notes        0 non-null      float64
 24  Unnamed: 24     0 non-null      float64
dtypes: float64(2), int64(1), object(22)
memory usage: 31.9+ KB

In [49]:
citynumbers=first.groupby('Location')['Degree'] \
                             .count() \
                             .reset_index(name='count') \
                             .sort_values(['count'], ascending=False) \
                             .head(5)

In [50]:
citynumbers

                                   Location  count
14          London, England, United Kingdom    112
13              London Area, United Kingdom     11
21                           United Kingdom      9
3   City of London, England, United Kingdom      2
25        West End, England, United Kingdom      1

In [51]:
industry=first.groupby('Industry')['Degree'] \
                             .count() \
                             .reset_index(name='count') \
                             .sort_values(['count'], ascending=False) \
                             .head(10)

In [52]:
industry

                              Industry  count
1                   Financial Services    148
0  Electrical/Electronic Manufacturing      9

In [53]:
company=first.groupby('Company')['Degree'] \
                             .count() \
                             .reset_index(name='count') \
                             .sort_values(['count'], ascending=False) \
                             .head(5)

In [54]:
company

                      Company  count
81                       HSBC      2
0    111 Security Systems LTD      1
107                   Met T&S      1
100                     METIS      1
101          MJ Hudson Meyler      1

In [81]:
title=first.groupby('Title')['Degree'] \
                             .count() \
                             .reset_index(name='count') \
                             .sort_values(['count'], ascending=False) \
                             .head(5)

In [82]:
title

                               Title  count
58                 Managing Director     46
22                          Director      8
25  Director Of Business Development      5
37                           Founder      4
39       Founder & Managing Director      2

In [57]:
first['Title']=='Director of Business Development'

209     False
210     False
211     False
212     False
213     False
        ...
1209    False
1210    False
1211    False
1212    False
1213    False
Name: Title, Length: 157, dtype: bool

In [58]:
DBD=first['Title']=='Director Of Business Development'

In [92]:
dbd=first[DBD]

In [93]:
dbd.count()

id                5
VisitTime         5
Profile           5
SalesProfile      5
Picture           5
Degree            5
First Name        5
Middle Name       5
Last Name         5
Connections       5
Summary           5
From              5
Title             5
Company           5
CompanyProfile    5
CompanyWebsite    5
Email             5
Phone             5
IM                5
Twitter           5
Location          5
Industry          5
My Tags           5
My Notes          0
Unnamed: 24       0
dtype: int64

In [61]:
first['Title']=='Managing Director'

209     False
210      True
211     False
212     False
213     False
        ...
1209    False
1210    False
1211     True
1212    False
1213     True
Name: Title, Length: 157, dtype: bool

In [62]:
MD=first['Title']=='Managing Director'

In [63]:
MD

209     False
210      True
211     False
212     False
213     False
        ...
1209    False
1210    False
1211     True
1212    False
1213     True
Name: Title, Length: 157, dtype: bool

In [66]:
md=first[MD]

In [67]:
md.groupby('Title')['Degree'].count()

Title
Managing Director    46
Name: Degree, dtype: int64

In [88]:
md.count()

id                46
VisitTime         46
Profile           46
SalesProfile      46
Picture           46
Degree            46
First Name        46
Middle Name       46
Last Name         46
Connections       46
Summary           46
From              46
Title             46
Company           46
CompanyProfile    46
CompanyWebsite    46
Email             46
Phone             46
IM                46
Twitter           46
Location          46
Industry          46
My Tags           46
My Notes           0
Unnamed: 24        0
dtype: int64

In [69]:
first['Title']=='Marketing Director'

209     False
210     False
211     False
212     False
213     False
        ...
1209    False
1210    False
1211    False
1212    False
1213    False
Name: Title, Length: 157, dtype: bool

In [76]:
MarD=first['Title']=='Marketing Director'

In [77]:
Mark=first[MarD]

In [89]:
Mark.count()

id                1
VisitTime         1
Profile           1
SalesProfile      1
Picture           1
Degree            1
First Name        1
Middle Name       1
Last Name         1
Connections       1
Summary           1
From              1
Title             1
Company           1
CompanyProfile    1
CompanyWebsite    1
Email             1
Phone             1
IM                1
Twitter           1
Location          1
Industry          1
My Tags           1
My Notes          0
Unnamed: 24       0
dtype: int64

In [95]:
first['Title']=='Marketing Manager'

209     False
210     False
211     False
212     False
213     False
        ...
1209    False
1210    False
1211    False
1212    False
1213    False
Name: Title, Length: 157, dtype: bool

In [96]:
MarM=first['Title']=='Marketing Manager'

In [98]:
MM=first[MarM]

In [99]:
MM.count()

id                1
VisitTime         1
Profile           1
SalesProfile      1
Picture           1
Degree            1
First Name        1
Middle Name       1
Last Name         1
Connections       1
Summary           1
From              1
Title             1
Company           1
CompanyProfile    1
CompanyWebsite    1
Email             1
Phone             1
IM                1
Twitter           1
Location          1
Industry          1
My Tags           1
My Notes          0
Unnamed: 24       0
dtype: int64

In [101]:
first['Title']=='Sales Director'

209     False
210     False
211     False
212     False
213     False
        ...
1209    False
1210    False
1211    False
1212    False
1213    False
Name: Title, Length: 157, dtype: bool

In [102]:
sd=first['Title']=='Sales Director'

In [103]:
SD=first[sd]

In [104]:
SD.count()

id                1
VisitTime         1
Profile           1
SalesProfile      1
Picture           1
Degree            1
First Name        1
Middle Name       1
Last Name         1
Connections       1
Summary           1
From              1
Title             1
Company           1
CompanyProfile    1
CompanyWebsite    1
Email             1
Phone             1
IM                1
Twitter           1
Location          1
Industry          1
My Tags           1
My Notes          0
Unnamed: 24       0
dtype: int64